#! /bin/sh

######################################################################
#
# jsonPath_sort
# JsonPath方式で保存されている状態で、
# キー列のソートをするスクリプト
#
# このソフトウェアは Public Domain (CC0)であることを宣言する。
#
######################################################################

# === 初期化 =========================================================
set -eu
umask 0022
export LC_ALL='C' PATH="$(command -p getconf PATH):$PATH"

# === 判定 ===========================================================
if [ -t 0 ] ; then
	file=$1
else
	file='-'
fi

#流し込み
sort -t "[" -k 1,1 -k 2n "$file"







